import React, { useState } from 'react';
import './AllStoriesPage.css';

const AllStoriesPage = ({ onBack }) => {

  const stories = [
    { title: 'قصة النحلة النشيطة', description: `المسؤولية والتفاعل مع المجتمع: يتعلم الطفل أهمية تحمل المسؤولية والتفاعل مع المجتمع من خلال مساعدة الأصدقاء الجدد في التلقيح، كما يظهر في اختيار الخيار (ب1)
التعلم من التجارب والتحديات: يتعلم الطفل أن التحديات والتجارب يمكن أن تكون فرصاً للتعلم والنمو، كما يظهر في مواجهة المواقف المختلفة التي تواجه "نحلة" و"وردة" وأصدقائهم
الصداقة والتفاهم: يتعلم الطفل قيمة الصداقة والتفاهم بين الأفراد، كما يظهر في تفاعل "نحلة" و"وردة" مع بعضهما البعض ومع أصدقائهم الجدد
التفكير النقدي واتخاذ القرارات: يتعلم الطفل أهمية التفكير النقدي واتخاذ القرارات المناسبة بناءً على المواقف والخيارات المتاحة، كما يظهر في اختيار الخيارات المختلفة لمساعدة "نحلة" و"وردة" وأصدقائهم
الإبداع والابتكار: يتعلم الطفل أهمية الإبداع والابتكار في حل المشكلات وإيجاد حلول جديدة، كما يظهر في اختيار الخيارات المختلفة لمساعدة "نحلة" و"وردة" وأصدقائهم
القيم الأخلاقية: يتعلم الطفل قيم أخلاقية مثل التعاون والمساعدة والتفاهم والاحترام المتبادل، كما يظهر في تفاعل الشخصيات الرئيسية مع بعضها البعض
`},
    {
      title: 'قصة فارس والفضاء',
      description: `
        الشغف والفضول: يتعلم الأطفال أهمية استكشاف العالم والفضول حول الفضاء والكواكب
        التعاون والعمل الجماعي: يتعلم الأطفال أهمية العمل معاً مع الأصدقاء والعائلة لتحقيق الأهداف المشتركة
        المثابرة والعزيمة: يتعلم الأطفال أن تحقيق الأحلام يتطلب الصبر والمثابرة وعدم الاستسلام أمام التحديات
        احترام البيئة والموارد: يتعلم الأطفال أهمية المحافظة على الموارد الطبيعية وتقدير قيمة الطعام (مثل التمر) كجزء من تراثهم وثقافتهم
        الإبداع والابتكار: يتعلم الأطفال كيفية استخدام خيالهم لتصميم وصنع الأشياء (مثل الصواريخ) وتطوير مهاراتهم الفنية
        التواصل والتفاعل الاجتماعي: يتعلم الأطفال أهمية التواصل مع الآخرين ومشاركة الأفكار والمشاعر مع الأصدقاء والعائلة
        تقدير العلم والتكنولوجيا: يتعلم الأطفال أهمية العلوم والتكنولوجيا في استكشاف الفضاء وتوسيع معرفتهم عن العالم 
      `,
    },
    { title: 'قصة الابل و الارقام', description: ` الفضول والتعلم: يشجع رياض فضوله ورغبته في استكشاف العالم والمعرفة. يتعلم أهمية طرح الأسئلة والبحث عن المعلومات لفهم الأمور بشكل أفضل
 الصبر والمثابرة: يتعلم رياض أن النجاح يأتي من المثابرة والصبر على التعلم. يواجه تحديات ويتعلم من أخطائه ويتقدم بثقة
 التعاون والعمل الجماعي: يتعلم رياض قيمة التعاون والعمل الجماعي من خلال مشاركته مع زملائه في الفصل الدراسي والمشروع الجماعي. يتعلم كيفية تبادل الأفكار والمعرفة والعمل معاً لتحقيق الأهداف
 الإبداع والابتكار: يتعلم رياض أهمية التفكير الإبداعي والابتكار في حل المشكلات. يطبق مفاهيم جديدة ويتعلم من تجاربه لتطوير مهاراته وقدراته
 احترام التنوع والتراث الثقافي: يتعلم رياض قيمة التنوع والتراث الثقافي من خلال تعرفه على أنواع الجمال المختلفة وإسهامات العلماء العرب والمسلمين في مجالات العلوم والرياضيات والفلك
 التواصل الفعّال: يتعلم رياض أهمية التواصل الفعّال من خلال مشاركته للمعرفة والأفكار مع زملائه ومعلمته. يتعلم كيفية التعبير عن آرائه والاستماع للآخرين
 المسؤولية والانضباط: يتعلم رياض قيمة المسؤولية والانضباط من خلال التزامه بواجباته المدرسية ومشاركته الفعّالة في الفصل الدراسي. يتعلم كيفية تنظيم وقته وتحديد أولويات مهامه
 تقدير التراث والتاريخ: يتعلم رياض قيمة التراث والتاريخ من خلال تعرفه على العلماء العرب والمسلمين وإسهاماتهم في تطور العلوم والتكنولوجيا. يتعلم تقدير الإنجازات السابقة وكيف أثرت على حياتنا اليومية
` },
    { title: 'قصة لينة صديقة الارض الخضراء', description: `النظافة: يتعلم الطفل أهمية المحافظة على نظافة البيئة والأماكن العامة
إعادة التدوير: يتعرف الطفل على عملية إعادة تدوير البلاستيك وفوائدها للبيئة
العمل الجماعي: يتعلم الطفل قيمة التعاون والعمل مع الآخرين لتحقيق الأهداف المشتركة
المسؤولية تجاه البيئة: يتعرف الطفل على أهمية المحافظة على البيئة والمساهمة في حمايتها
التعاطف مع الحيوانات: يتعلم الطفل أهمية مساعدة الحيوانات المحتاجة والتفاعل الإيجابي مع المواقف التي تتضمن حياة الحيوانات
اتخاذ القرارات: يتعلم الطفل كيفية تقييم الخيارات واتخاذ القرارات المناسبة بناءً على المعلومات المتوفرة والقيم الأخلاقية
` },
    { title: 'قصة رحلة ليلى الى جبال الطائف', description: `التعاون والتفاهم بين الأصدقاء: يتعلم الطفل أهمية العمل معاً ومشاركة التجارب مع الآخرين
احترام التراث والثقافة: يتعلم الطفل قيمة التراث الطبيعي والثقافي وضرورة المحافظة عليه
الفضول والاستكشاف: يشجع الطفل على استكشاف العالم من حوله وطرح الأسئلة للتعرف على المزيد
المشاركة والتبادل: يتعلم الطفل أهمية مشاركة المعرفة والتجارب مع الآخرين
الصبر والمثابرة: يتعلم الطفل قيمة الصبر والمثابرة عند مواجهة التحديات والمغامرات الجديدة
` },
  ];

  const [selectedStory, setSelectedStory] = useState(stories[0]);


  const handleStoryClick = (story) => setSelectedStory(story);
  const closeDescription = () => setSelectedStory(null);

 return (
    <div className="all-stories-page">


        <button onClick={onBack} className="all-stories-back-button">
    <img src="/Images/backarrow.svg" alt="Back Icon" className="back-icon" />
    <span>العودة</span></button>


      <ul className="story-list">
        {stories.map((story, index) => (
          <li key={index}>


           <button
  className={`story-button ${selectedStory?.title === story.title ? 'active' : ''}`}
  onClick={() => handleStoryClick(story)}
>
  {story.title}
</button>

          </li>
        ))}
      </ul>

      {selectedStory && (
        <div className="story-description-box">
          <h2>{selectedStory.title}</h2>
          <ul>
            {selectedStory.description
              .trim()
              .split('\n')
              .map((line, index) => (
                <li key={index}>{line.trim()}</li>
              ))}
          </ul>
        </div>
      )}
    </div>
  );
};

export default AllStoriesPage;
